Script started on Tue 06 Mar 2018 10:06:49 PM CST
a049841[21]% HALstart
[3;J[H[2J
*********************************************
*               HALos v5.3.6                *
*                                           *
*  Copyright (c) 2018 Robert J. Hilderman.  *
*           All Rights Reserved.            *
*********************************************

HALstart: powering up HAL9000 ...
HALstart: HAL9000 OK
HAL9000: initializing ...
HAL9000: boot sequence started ...
HAL9000: checking clock ...
HAL9000: clock OK
HAL9000: loading HALbios ...
HAL9000: HALbios OK
HALbios: initializing ...
HALbios: checking memory ...
HALbios: memory OK
HALbios: loading HALos ...
HALbios: HALos OK
HALos: initializing ...
HALos: loading HALshell ...
HALos: HALshell OK
HALshell: initializing ...

HALshell[1]> stopcpuscheduler
HALshell: PID = [1] RETURN_VALUE = [ok] MESSAGE = [cpu scheduler stopped]
HALshell[2]> halprograms/lop opwithvariablecounter 10000 -
HALshell: PID = [2] MESSAGE = [background process created]
HALshell[3]> halprograms/loopwithvariablecounter 10000 -
HALshell: PID = [3] MESSAGE = [background process created]
HALshell[4]> halprograms/loopwithvariablecounter 10000 -
HALshell: PID = [4] MESSAGE = [background process created]
HALshell[5]> halprograms/loopwithvariablecounter 10000 -
HALshell: PID = [5] MESSAGE = [background process created]
HALshell[6]> halprograms/loopwithvariablecounter 10000 -
HALshell: PID = [6] MESSAGE = [background process created]
HALshell[7]> halprograms/loopwithvariablecounter 10000 -
HALshell: PID = [7] MESSAGE = [background process created]
HALshell[8]> halprograms/loopwithvariablecounter 10000 -
HALshell: PID = [8] MESSAGE = [background process created]
HALshell[9]> halprograms/loopwithvariablecounter 10000 -
HALshell: PID = [9] MESSAGE = [background process created]
HALshell[10]> startcpuscheduler
HALshell: PID = [10] RETURN_VALUE = [ok] MESSAGE = [cpu scheduler started]
HALshell[11]> result
HALshell: PID = [4] RETURN_VALUE = []MESSAGE = [creation time =30 -90010 733390 89 1 startTime = 0 endTime = 733390]
HALshell: PID = [5] RETURN_VALUE = []MESSAGE = [creation time =30 -90010 734365 89 1 startTime = 0 endTime = 734365]
HALshell: PID = [6] RETURN_VALUE = []MESSAGE = [creation time =30 -90010 735150 89 1 startTime = 0 endTime = 735150]
HALshell: PID = [7] RETURN_VALUE = []MESSAGE = [creation time =30 -90010 735660 89 1 startTime = 0 endTime = 735660]
HALshell: PID = [9] RETURN_VALUE = []MESSAGE = [creation time =30 -90010 737414 89 1 startTime = 0 endTime = 737414]
HALshell: PID = [2] RETURN_VALUE = []MESSAGE = [creation time =30 -90010 737509 90 1 startTime = 0 endTime = 737509]
HALshell: PID = [3] RETURN_VALUE = []MESSAGE = [creation time =30 -90010 737709 90 1 startTime = 0 endTime = 737709]
HALshell: PID = [8] RETURN_VALUE = []MESSAGE = [creation time =30 -90010 737910 90 1 startTime = 0 endTime = 737910]
HALshell[12]> shutdown

HALshell: terminating ...
HALos: terminating ...
HAL9000: powering down ...
a049841[22]% exit
exit

Script done on Tue 06 Mar 2018 10:09:38 PM CST
