Script started on Tue 06 Feb 2018 05:57:52 PM CST
a049841[21]% HALstart
[3;J[H[2J
*********************************************
*               HALos v5.3.6                *
*                                           *
*  Copyright (c) 2018 Robert J. Hilderman.  *
*           All Rights Reserved.            *
*********************************************

HALstart: powering up HAL9000 ...
HALstart: HAL9000 OK
HAL9000: initializing ...
HAL9000: boot sequence started ...
HAL9000: checking clock ...
HAL9000: clock OK
HAL9000: loading HALbios ...
HAL9000: HALbios OK
HALbios: initializing ...
HALbios: checking memory ...
HALbios: memory OK
HALbios: loading HALos ...
HALbios: HALos OK
HALos: initializing ...
HALos: loading HALshell ...
HALos: HALshell OK
HALshell: initializing ...

HALshell[1]> stopcpuscheduler
HALshell: PID = [1] RETURN_VALUE = [ok] MESSAGE = [cpu scheduler stopped]
HALshell[2]> halprograms/loopwithvariablecounter 1000 -
HALshell: PID = [2] MESSAGE = [background process created]
HALshell[3]> halprograms/loopwithvariablecounter 8000 -
HALshell: PID = [3] MESSAGE = [background process created]
HALshell[4]> halprograms/loopwithvariablecounter 4000 -
HALshell: PID = [4] MESSAGE = [background process created]
HALshell[5]> halprograms/loopwithvariablecounter 10000 -
HALshell: PID = [5] MESSAGE = [background process created]
HALshell[6]> halprograms/loopwithvariablecounter 3000 -
HALshell: PID = [6] MESSAGE = [background process created]
HALshell[7]> halprograms/loopwithvariablecounter 7000 -
HALshell: PID = [7] MESSAGE = [background process created]
HALshell[8]> halprograms/loopwithvariablecounter 5000 -
HALshell: PID = [8] MESSAGE = [background process created]
HALshell[9]> halprograms/loopwithvariablecounter 2000 -
HALshell: PID = [9] MESSAGE = [background process created]
HALshell[10]> halprograms/loopwithvariablecounter 6000 -
HALshell: PID = [10] MESSAGE = [background process created]
HALshell[11]> halprograms/loopwithvariablecounter 9000 -
HALshell: PID = [11] MESSAGE = [background process created]
HALshell[12]> startcpuscheduler
HALshell: PID = [12] RETURN_VALUE = [ok] MESSAGE = [cpu scheduler started]
HALshell[13]> result
HALshell: PID = [2] RETURN_VALUE = []MESSAGE = [creation time =30 -9010 9020 0 1]
HALshell: PID = [3] RETURN_VALUE = []MESSAGE = [creation time =30 -72010 81040 0 1]
HALshell: PID = [4] RETURN_VALUE = []MESSAGE = [creation time =30 -36010 117060 0 1]
HALshell: PID = [5] RETURN_VALUE = []MESSAGE = [creation time =30 -90010 207080 0 1]
HALshell: PID = [6] RETURN_VALUE = []MESSAGE = [creation time =30 -27010 234100 0 1]
HALshell: PID = [7] RETURN_VALUE = []MESSAGE = [creation time =30 -63010 297120 0 1]
HALshell: PID = [8] RETURN_VALUE = []MESSAGE = [creation time =30 -45010 342140 0 1]
HALshell: PID = [9] RETURN_VALUE = []MESSAGE = [creation time =0 -18010 360160 0 30]
HALshell: PID = [10] RETURN_VALUE = []MESSAGE = [creation time =30 -54010 414180 0 1]
HALshell: PID = [11] RETURN_VALUE = []MESSAGE = [creation time =30 -81010 495200 0 1]
HALshell[14]> shutdown

HALshell: terminating ...
HALos: terminating ...
HAL9000: powering down ...
a049841[22]% exit
exit

Script done on Tue 06 Feb 2018 06:06:41 PM CST
